In [1]:
import pandas as pd
cust_rating = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/GvOkzy5MLdy9zJ8vXMArwpRvN/rating_final.csv')

In [4]:
cust_rating.head()

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2

In [5]:
cust_rating.isnull().sum()

userID            0
placeID           0
rating            0
food_rating       0
service_rating    0
dtype: int64

In [11]:
cust_rating["average"] = round((cust_rating.rating + cust_rating.food_rating + cust_rating.service_rating) / 3, 2)

In [9]:
round((cust_rating.rating + cust_rating.food_rating + cust_rating.service_rating)/3, 2)

0       2.00
1       1.67
2       2.00
3       1.67
4       1.33
        ...
1249    1.00
1250    0.67
1251    0.67
1252    1.00
1253    0.00
Length: 1254, dtype: float64

In [12]:
cust_rating.head()

  userID  placeID  rating  food_rating  service_rating  average
0  U1077   135085       2            2               2     2.00
1  U1077   135038       2            2               1     1.67
2  U1077   132825       2            2               2     2.00
3  U1077   135060       1            2               2     1.67
4  U1068   135104       1            1               2     1.33

In [13]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
df = pd.read_csv("odi-batting.csv")

In [15]:
df.head()

,Country,Player,Runs,MatchDate,Weekday,Ground,Versus,Balls
0,Afghanistan,Mohammad Shahzad,118,16-02-2010,Tue,Sharjah CA Stadium,Canada,121
1,Afghanistan,Mohammad Shahzad,110,01-09-2009,Tue,VRA Ground,Netherlands,111
2,Afghanistan,Mohammad Shahzad,100,16-08-2010,Mon,Cambusdoon New Ground,Scotland,72
3,Afghanistan,Mohammad Shahzad,82,10-07-2010,Sat,Hazelaarweg,Netherlands,108
4,Afghanistan,Mohammad Shahzad,57,01-07-2010,Thu,Sportpark Westvliet,Canada,57

In [19]:
int(180/100)

1

In [21]:
df["Century"] = df.Runs.apply(lambda x: int(x/100))

In [22]:
df.head()

,Country,Player,Runs,MatchDate,Weekday,Ground,Versus,Balls,Century
0,Afghanistan,Mohammad Shahzad,118,16-02-2010,Tue,Sharjah CA Stadium,Canada,121,1
1,Afghanistan,Mohammad Shahzad,110,01-09-2009,Tue,VRA Ground,Netherlands,111,1
2,Afghanistan,Mohammad Shahzad,100,16-08-2010,Mon,Cambusdoon New Ground,Scotland,72,1
3,Afghanistan,Mohammad Shahzad,82,10-07-2010,Sat,Hazelaarweg,Netherlands,108,0
4,Afghanistan,Mohammad Shahzad,57,01-07-2010,Thu,Sportpark Westvliet,Canada,57,0

In [24]:
centuries_by_player = df.groupby('Player')['Century'].sum().reset_index()

# Rename the columns for clarity
centuries_by_player.columns = ['Player', 'Century']

print(centuries_by_player)

                 Player  Century
0           Aamer Hanif        0
1           Aamer Malik        0
2           Aamir Nazir        0
3          Aamir Sohail        5
4           Aaqib Javed        0
...                 ...      ...
1878       Zameer Zahir        0
1879    Zubin E Surkari        0
1880       Zulfiqar Ali        0
1881  Zulqarnain Haider        0
1882        Zulquarnain        0

[1883 rows x 2 columns]

In [25]:
centuries_by_player[centuries_by_player.Player == "Sachin R Tendulkar"]

                  Player  Century
1517  Sachin R Tendulkar       49